Autodesk.Revit.DB.FillPatternTarget
The type of the fill pattern.
Since:
2012

Autodesk.Revit.DB.FillPatternTarget.Model
Represents an actual element appearance on a building.

Autodesk.Revit.DB.FillPatternTarget.Drafting
Represents a material in symbolic form.